#https://en.wikipedia.org/wiki/LRC_(file_format)
'''
[00:12.00]Line 1 lyrics
[00:17.20]Line 2 lyrics
[00:21.10]Line 3 lyrics
...
[mm:ss.xx]last lyrics line
'''
# https://wiki.python.org/moin/WorkingWithTime

aTimeText= '''
[00:01.85]家後
[00:05.60]作詞：鄭進一/陳維祥 作曲：鄭進一
[00:21.58]有一日咱若老　找無人甲咱友孝
[00:31.21]我會陪你　坐惦椅寮
[00:36.33]聽你講少年的時陣　你有外摮
[00:41.50]吃好吃醜無計較　怨天怨地嘛袂曉
[00:51.48]你的手　我會甲你牽條條
[00:56.03]因為我是你的家後
[01:04.34]阮將青春嫁置恁兜　阮對少年跟你跟甲老
[01:13.84]人情世事已經看透透　有啥人比你卡重要
[01:24.65]阮的一生獻乎恁兜　才知幸福是吵吵鬧鬧
[01:34.19]等待返去的時陣若到　我會讓你先走
[01:44.74]因為我會嘸甘　放你為我目屎流
[02:00.25]
[02:16.08]有一日咱若老　有媳婦子兒友孝
[02:26.05]你若無聊　拿咱的相片
[02:30.99]看卡早結婚的時陣　你外緣投
[02:36.20]穿好穿醜無計較　怪東怪西嘛袂曉
[02:46.38]你的心我會永遠記條條　因為我是你的家後
[02:59.11]阮將青春嫁置恁兜　阮對少年就跟你跟甲老
[03:08.66]人情世事嘛已經看透透　有啥人比你卡重要
[03:19.49]阮的一生獻乎恁兜　才知幸福是吵吵鬧鬧
[03:29.47]等待返去的時陣若到　我著讓你先走
[03:39.24]因為我會嘸甘　放你為我目屎流
[03:50.47]
'''
aL= aTimeText.split('\n')
while '' in aL: aL.remove('')

import re

lrcL= []
for x in aL:
    tm, tx= re.split(']',x)
    tm= tm.replace('[','')
    m,s = tm.split(':')
    m= int(m)
    s= float(s)
    s= m*60+s
    i框= int(s*16000/1024)
    lrcL += [(i框,tx)]
    
print('lrcL= {}'.format(lrcL))
'''
[(28, '家後'),
 (87, '作詞：鄭進一/陳維祥 作曲：鄭進一'),
 (337, '有一日咱若老\u3000找無人甲咱友孝'),
 (487, '我會陪你\u3000坐惦椅寮'),
 (567, '聽你講少年的時陣\u3000你有外摮'),
 (648, '吃好吃醜無計較\u3000怨天怨地嘛袂曉'),
 (804, '你的手\u3000我會甲你牽條條'),
 (875, '因為我是你的家後'),
 (1005, '阮將青春嫁置恁兜\u3000阮對少年跟你跟甲老'),
 (1153, '人情世事已經看透透\u3000有啥人比你卡重要'),
 (1322, '阮的一生獻乎恁兜\u3000才知幸福是吵吵鬧鬧'),
 (1471, '等待返去的時陣若到\u3000我會讓你先走'),
 (1636, '因為我會嘸甘\u3000放你為我目屎流'),
 (1878, ''),
 (2126, '有一日咱若老\u3000有媳婦子兒友孝'),
 (2282, '你若無聊\u3000拿咱的相片'),
 (2359, '看卡早結婚的時陣\u3000你外緣投'),
 (2440, '穿好穿醜無計較\u3000怪東怪西嘛袂曉'),
 (2599, '你的心我會永遠記條條\u3000因為我是你的家後'),
 (2798, '阮將青春嫁置恁兜\u3000阮對少年就跟你跟甲老'),
 (2947, '人情世事嘛已經看透透\u3000有啥人比你卡重要'),
 (3117, '阮的一生獻乎恁兜\u3000才知幸福是吵吵鬧鬧'),
 (3272, '等待返去的時陣若到\u3000我著讓你先走'),
 (3425, '因為我會嘸甘\u3000放你為我目屎流'),
 (3601, '')]
'''
